_posts/2016-03-30-Jump-to-a-tagged-src-block.html
---
title: Jump to a tagged src block
date: 2016/03/30 14:26:35
updated: 2016/03/30 14:26:35
categories: emacs,orgmode
tags: 
---


<p>
If you have a lot of src-blocks in your org-file, it might be nice to "tag" them and be able to jump around between them using tag expressions, or by the name of the block, language etc&#x2026; Here we develop a way to do that and create a handy function to jump to blocks in the current buffer.
</p>

<p>
First, we look at how to "tag" a src-block. One way is to use a header like this:
</p>

<pre class="example">
#+header: :tags cool idiom two
</pre>

<p>
These are not tags in the usual org-mode sense, they are just a space separated list of words we will later treat as tags. We can get the tags on a src-block with this function.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #0000FF;">defun</span> <span style="color: #006699;">src-block-tags</span> (src-block)
  <span style="color: #036A07;">"Return tags for SRC-BLOCK (an org element)."</span>
  (<span style="color: #0000FF;">let*</span> ((headers (<span style="color: #0000FF;">-flatten</span>
                   (mapcar 'org-babel-parse-header-arguments
                           (org-element-property <span style="color: #006FE0;">:header</span> src-block))))
         (tags (cdr (assoc <span style="color: #006FE0;">:tags</span> headers))))
    (<span style="color: #0000FF;">when</span> tags
      (split-string tags))))
</pre>
</div>

<pre class="example">
src-block-tags
</pre>

<p>
Now, we make a src-block with the tags "test" "one" and "idiom", and see how to tell if the block matches the tag expression "test+idiom".
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp" id="tag-matcher">(<span style="color: #0000FF;">let*</span> ((lexical-binding nil)
       (todo-only nil)
       (tags-list (src-block-tags (org-element-context)))
       (tag-expression <span style="color: #008000;">"test+idiom"</span>))
  (eval (cdr (org-make-tags-matcher tag-expression))))
</pre>
</div>
<pre class="example">
t
</pre>

<p>
It does, so we wrap that up into a function that tells us if a src-block matches some tag expression.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #0000FF;">defun</span> <span style="color: #006699;">src-block-match-tag-expression-p</span> (src-block tag-expression)
  <span style="color: #036A07;">"Determine if SRC-BLOCK matches TAG-EXPRESSION."</span>
  (<span style="color: #0000FF;">let*</span> ((lexical-binding nil)
         (todo-only nil)
         (tags-list (src-block-tags src-block)))
    (eval (cdr (org-make-tags-matcher tag-expression)))))
</pre>
</div>
<pre class="example">
src-block-match-tag-expression-p
</pre>

<p>
Here we test that on a block tagged "one three" on the expression "one-two" which means tagged one and not two.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(src-block-match-tag-expression-p (org-element-context) <span style="color: #008000;">"one-two"</span>)
</pre>
</div>
<pre class="example">
t
</pre>

<p>
Those are the main pieces we need to jump around. We just need a selection tool with a list of filtered candidates. We get a list of src-block candidates to choose from in the next block as an example. Here we get blocks tagged one but not two. We can incorporate this into a selection backend like helm or ivy.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(org-element-map (org-element-parse-buffer) 'src-block
  (<span style="color: #0000FF;">lambda</span> (src-block)
    (<span style="color: #0000FF;">when</span> (src-block-match-tag-expression-p src-block <span style="color: #008000;">"one-two"</span>)
      <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">Get a string and marker</span>
      (cons
       (format <span style="color: #008000;">"%15s|%15s|%s"</span>
               (org-element-property <span style="color: #006FE0;">:name</span> src-block)
               (org-element-property <span style="color: #006FE0;">:language</span> src-block)
               (org-element-property <span style="color: #006FE0;">:header</span> src-block))
       (org-element-property <span style="color: #006FE0;">:begin</span> src-block)))))
</pre>
</div>
<div class="org-src-container">

<pre class="src src-emacs-lisp">((<span style="color: #008000;">"    tag-matcher|     emacs-lisp|(:tags test one idiom)"</span> . 1222)
 (<span style="color: #008000;">"            nil|     emacs-lisp|(:tags one)"</span> . 1641)
 (<span style="color: #008000;">"            nil|     emacs-lisp|(:tags one three)"</span> . 2120))
</pre>
</div>

<p>
Now let us put that into ivy. We will ask for an expression to filter the blocks on, and then use ivy to narrow what is left, and the only action is to jump to the position of the selected block. You can start with a tag expression, or press enter to get all the tags. Then you can use ivy to further narrow by language, block name, or other tags.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #0000FF;">defun</span> <span style="color: #006699;">ivy-jump-to-src</span> (tag-expression)
  (<span style="color: #0000FF;">interactive</span> <span style="color: #008000;">"sTag expression: "</span>)
  (ivy-read <span style="color: #008000;">"Select: "</span>
            (org-element-map (org-element-parse-buffer) 'src-block
              (<span style="color: #0000FF;">lambda</span> (src-block)
                (<span style="color: #0000FF;">when</span> (src-block-match-tag-expression-p src-block tag-expression)
                  <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">Get a string and marker</span>
                  (cons
                   (format <span style="color: #008000;">"%15s|%15s|%s"</span>
                           (org-element-property <span style="color: #006FE0;">:name</span> src-block)
                           (org-element-property <span style="color: #006FE0;">:language</span> src-block)
                           (org-element-property <span style="color: #006FE0;">:header</span> src-block))
                   (org-element-property <span style="color: #006FE0;">:begin</span> src-block)))))
            <span style="color: #006FE0;">:require-match</span> t
            <span style="color: #006FE0;">:action</span> '(1
                      (<span style="color: #008000;">"j"</span> (<span style="color: #0000FF;">lambda</span> (pos) (<span style="color: #0000FF;">interactive</span>) (goto-char pos))))))
</pre>
</div>

<pre class="example">
ivy-jump-to-src
</pre>

<p>
For fun, here is a python block just for testing.
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #0000FF;">print</span>(42)
</pre>
</div>

<pre class="example">
42
</pre>

<p>
That is it! It seems to work ok. There are some variations that might be preferrable, like putting the tags in as params in the src-block header to avoid needing a separate header line. It isn't clear how much I would use this, and it is slow if you have <i>a lot</i> of src blocks in a /large/org-file because of the parsing. (how large? I noticed a notable lag on my 22,800 line org-file this is in ;).
</p>
<p>Copyright (C) 2016 by John Kitchin. See the <a href="/copying.html">License</a> for information about copying.<p>
<p><a href="/org/2016/03/30/Jump-to-a-tagged-src-block.org">org-mode source</a></p>
<p>Org-mode version = 8.2.10</p>